Revit 2027 API
MacroModule.GetMacro Method
 Gets the macro with the give name.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Macro GetMacro(
	string name
)
Public Function GetMacro (
	name As String
) As Macro
public:
Macro^ GetMacro(
	String^ name
)
member GetMacro :
        name : string -> Macro
Parameters
name String
 The macro name.
Return Value
Macro
 The macro.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MacroModule Class
Autodesk.Revit.DB.Macros Namespace